verification/runs/F14-cooling-ladder/K0c_runs/Ra1e4_m40/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    hotWall         { type fixedFluxPressure; value uniform 0; }
    coldWall        { type fixedFluxPressure; value uniform 0; }
    adiabaticWalls  { type fixedFluxPressure; value uniform 0; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
